import time
from Data_output_interface import *

# Получаем имя программы
program_name = os.path.basename(__file__)

# Запускаем программу и получаем время старта
time_start = console_start(program_name)

# Основной код программы
# ------------------------------------------------------------------------------------------------------------------

time.sleep(5)  # Например, задержка для теста работы программы

# ------------------------------------------------------------------------------------------------------------------

# Получаем время завершения программы и выводим сводку
time_stop = console_stop(program_name, time_start)
summary(program_name, time_start, time_stop)
